app/controllers/article_controller.rb

    def create
        a = Article.create(title: params[:title], author: params[:author], body: params[:body], category: params[:category], date: params[:date])
---
INSERT INTO "articles" ("title", "author", "body", "category", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def readAll
        articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]

    def readPage
        pages = (params[:pageNo]).to_i
        pages = pages - 1;
        lim = 2
        a = 0
        for i in 1..pages
            a += lim
        end
        a = Article.offset(a).limit(lim)
---
SELECT "articles".* FROM "articles" WHERE "articles"."title LIKE ?" = ?  [["title LIKE ?", "Free"]]

    def readByTitle
        a = Article.where("title LIKE ?", "%#{params[:title]}%")
---
SELECT "articles".* FROM "articles" WHERE (title LIKE '%Freedom%')

    def readByAuthor
        a = Article.where(author: params[:author])
---
SELECT "articles".* FROM "articles" WHERE "articles"."author" = ?  [["author", "Anne Frank"]]

    def readByCategory
        a = Article.where(category: params[:category])
---
SELECT "articles".* FROM "articles" WHERE "articles"."category" = ?  [["category", "Philosophy"]]

    def readByRange
        a = Article.where(date: (params[:start]..params[:end]))
---
SELECT "articles".* FROM "articles" WHERE "articles"."date" BETWEEN ? AND ?  [["date", "1942-01-01"], ["date", "1945-01-01"]]

    def updateById
        a = Article.update(params[:id], title: params[:title], author: params[:author], body: params[:body], category: params[:category], date: params[:date])
---
UPDATE "articles" SET "author" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["author", "Enid"], ["updated_at", "2023-02-04 05:32:29.261460"], ["id", 28]]

    def updateByTitle
        a = Article.where(title: params[:title]).update(title: params[:title], author: params[:author], body: params[:body], category: params[:category], date: params[:date])
---
SELECT "articles".* FROM "articles" WHERE "articles"."title" = ?  [["title", "Freedom"]]
UPDATE "articles" SET "title" = ?, "author" = ?, "body" = ?, "category" = ?, "date" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "The Kite Runner"], ["author", nil], ["body", nil], ["category", nil], ["date", nil], ["updated_at", "2023-02-04 07:11:36.110024"], ["id", 28]]

    def partialUpdate
        a = Article.find(params[:id])
        a.title = params[:title] || a.title
        a.author = params[:author] || a.author
        a.body = params[:body] || a.body
        a.category = params[:category] || a.category
        a.date = params[:date] || a.date
        a.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "author" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Famous"], ["author", "Enid Blyton"], ["updated_at", "2023-02-04 09:21:28.409192"], ["id", 28]]

    def delete
        a = Article.where(category: params[:category]).destroy_all
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", nil]]
SELECT "articles".* FROM "articles" WHERE "articles"."category" = ?  [["category", "Philosophy"]]

    def deleteAll
        a = Article.destroy_all
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 24]]